import React from 'react';
import {StyleSheet, View, SafeAreaView, ScrollView} from 'react-native';
import {Layout, Text, TopNavigation, Divider} from '@ui-kitten/components';

const ExerciseKnowledgeScreen = () => {
  return (
    <SafeAreaView style={{flex: 1}}>
      <>
        <TopNavigation title="Exercise" alignment="center" />
        <Divider />
        <ScrollView>
          <Layout style={{flex: 1, padding: 8}}>
            <Text style={styles.title} category="h5">
              Knowledge
            </Text>
            <Text>
              การออกกำลังกายเป็นสิ่งจำเป็นต่อสุขภาพของผู้สูงอายุ
              เนื่องจากช่วยชะลอความเสื่อมและเพิ่มความแข็งแรงของอวัยวะต่าง ๆ
              ของร่างกายเช่น กระดูก กล้ามเนื้อและข้อ ปอด หัวใจ เป็นต้น
              การออกกำลังกายอย่างส่ำเสมอ ทำให้ร่างกายกระปรี้กระเปร่า
              กระฉับกระเฉง ว่องไว
            </Text>
            <Text style={styles.title}>
              การออกกำลังกายที่เหมาะสมกับผู้สูงอายุ ได้แก่
            </Text>
            <Text style={styles.title} category="h6">
              การเดิน
            </Text>
            <Text>
              การเดินออกกำลังกาย ผู้สูงอายุควรเดินให้เร็ว
              เพื่อให้หัวใมีการเต้นเพิ่มขึ้น อื่น ๆ หากเดินเร็วมากไม่ได้
              ควรต้องเพิ่มเวลาในการเดินให้มากขึ้น เลือกใช้รองเท้าที่เหมาะสม
              และควรเดินออกกำลังกายในตอนเช้าในที่มีอากาศบริสุทธิ์ปลอดโปร่ง
            </Text>
            <Text style={styles.title} category="h6">
              การวิ่ง
            </Text>
            <Text>
              การวิ่ง ควรวิ่งช้า ๆ
              หรับผู้ที่มีสุขภาพเข่าและข้อเท้าดีและเลือกใส่รองเท้าที่เหมาะสมกับการวิ่ง
              ถ้ารู้สึกเหนื่อยมากควรหยุด หรือเปลี่ยนเป็นเดิน
              เมื่อหายเหนื่อยแล้วจึงวิ่งต่อ
              ถ้าร่างกายแข็งแรงควรวิ่งให้นานขึ้นโดยควรเพิ่มระยะเวลาในการวิ่งมากกว่าเพิ่มความเร็วในการวิ่ง
              เนื่องจาก อาจเป็นอันตรายต่อสุขภาพ
            </Text>
            <Text style={styles.title} category="h6">
              โยคะ
            </Text>
            <Text>
              โยคะ การออกกกำลังกายแบบโยคะ
              จะเป็นการออกกำลังกายที่ผสมผสานไปกับการหายใจให้ออกซิเจนได้เข้าสู่ร่างกายดีขึ้น
              นอกจากนี้ยังช่วยให้ผู้สูงอายุสม่ำสมาธิและมีจิตใจที่ปลอดโปร่งแจ่มใสด้วย
              อย่างไรก็ตามควรฝึกกับครูผู้ชำนาญ
              เพื่อป้องกันการบาดเจ็บที่อาจเกิดขึ้นได้
            </Text>
            <Text style={styles.title} category="h6">
              การรรำมวยจีน
            </Text>
            <Text>
              การรำมวยจีนคล้ายกับการฝึกโยคะในแง่ที่จะช่วยให้ผู้สูงอายุฝึกสมาธิไปในตัว
              จะเน้นการเคลื่อนไหวอย่างช้า ๆ ของร่างกายทุกส่วน
              เหมาะกับผู้สูงอายุทั่วไปที่ไม่มีปัญหาเรื่องข้อเท้า
              ควรฝึกภายใต้การดูแลของครูผู้ชำนาญเช่นกัน
            </Text>
            <Text style={styles.title} category="h6">
              การรำไม้พลอง
            </Text>
            <Text>
              จะช่วยในการรักษาความสามารถทางการเคลื่อนไหวของข้อต่าง ๆ ในร่างกาย
              แต่อาจไม่เหมาะกับผู้สูงอายุที่มีปัญหาเรื่องกระดูกสันหลัง
              ควรปรึกษาแพทย์หรือนักกายภาพบำบัดก่อนเลือกท่าที่เหมาะสม
            </Text>
          </Layout>
        </ScrollView>
      </>
    </SafeAreaView>
  );
};

export default ExerciseKnowledgeScreen;

const styles = StyleSheet.create({
  title: {
    marginTop: 8,
    marginBottom: 8,
  },
});
