import React from 'react';
import {StyleSheet, View, SafeAreaView, ScrollView} from 'react-native';
import {Layout, Text, TopNavigation, Divider} from '@ui-kitten/components';

const FirstAidKnowledgeScreen = () => {
  return (
    <SafeAreaView style={{flex: 1}}>
      <>
        <TopNavigation title="First Aid" alignment="center" />
        <Divider />
        <ScrollView>
          <Layout style={{flex: 1, padding: 8}}>
            <Text style={styles.title}>Knowledge</Text>
            <Text style={styles.title} category="h6">
              หกล้ม
            </Text>
            <Text>
              อย่างแรกคนใกล้ชิดต้องลองตรวจสอบการตอบสนองก่อน ด้วยการถามชื่อ ตัวตน
              เหตุการณ์ที่เกิดขึ้นถ้ารู้สึกว่าการตอบสนองช้าลงให้รีบไปพบแพทย์ทันที
              จากนั้นลองสังเกตบริเวณที่ปวดว่าขยับได้ไหม บวม หรือผิดรูปไหม
              ถ้าผิดรูปก็ให้ไปพบแพทย์เช่นกัน
            </Text>
            <Text style={styles.title} category="h6">
              ห้ามเลือด
            </Text>
            <Text>
              เมื่อมีบาดแผลเลือดออก
              คือต้องรีบใช้ผ้าสะอาดหรือนิ้วมือกดลงบนแผลหรือตำแหน่งที่มีเลือดออกก่อน
              แล้วจัดการให้ผู้สูงอายุนอนยกบาดแผลให้อยู่สูงกว่าบริเวณหน้าอกหรือหัวใจ
              จะทำให้เลือดออกน้อยลง และหยุดได้ง่ายขึ้น
              แต่ถ้ามีเลือดออกมากให้รีบกดไปที่เส้นเลือดใหญ่
              แล้วเลือดจะไม่ไหลเข้ามาที่บาดแผล
              ส่วนเลือดที่ไหลอยู่ก่อนแล้วจะมีโอกาสแข็งตัว
              ซึ่งนั่นเป็นการห้ามเลือดไปในตัว
            </Text>
            <Text style={styles.title} category="h6">
              กระดูกหัก
            </Text>
            <Text>
              เมื่อเห็นอวัยวะผิดรูปเมื่อไร
              พยายามอย่าดึงหรือจัดกระดูกให้เข้าที่ด้วยตัวเอง
              ถ้าต้องถอดเสื้อผ้าออกให้ตัดตามตะเข็บ ใช้หมอน ผ้า
              ประคองให้อยู่ท่าที่สบายและนิ่ง แล้วใช้ไม้กระดาน
              กิ่งไม้หรือกระดาษแข็งมาพันกับผ้าเพื่อทำเป็นเฝือกชั่วคราว
              ประคบด้วยผ้าหรือถุงใส่น้ำแข็ง แล้วรีบนำส่งโรงพยาบาล
              สำคัญที่สุดคือให้อวัยวะที่ หักอยู่นิ่ง ไม่เคลื่อนไหว
              หรือได้รับความกระทบกระเทือนน้อยที่สุด
            </Text>
            <Text style={styles.title} category="h6">
              หน้ามืด วิงเวียน เป็นลม
            </Text>
            <Text>
              ถ้าผู้สูงอายุมีอาการหน้ามืด วิงเวียน
              หรือจะเป็นลมต้องระวังอย่าให้ล้ม รีบเข้าไปพยุงให้นอนราบลงกับพื้น
              คลายเสื้อผ้าออกให้หลวม นอนให้หัวอยู่ต่ำไว้ แล้วยกปลายเท้าขึ้นสูงๆ
              เพื่อ ให้เลือดไหลไปเลี้ยงสมอง
              จัดการเรียบร้อยแล้วใช้แอมโมเนียหอมชุบสำลีส่ายไปมาที่จมูก
              พัดให้อากาศถ่ายเท ใช้ผ้าชุบน้ำเช็ดบริเวณแขนขา
              เมื่ออาการดีขึ้นแล้วจึงสามารถเคลื่อนไหวได้
            </Text>
            <Text style={styles.title} category="h6">
              สำลักอาหาร
            </Text>
            <Text>
              ก่อนอื่นต้องบอกให้ผู้สูงอายุไอเพื่อขับสิ่งแปลกปลอมออกมา
              แต่ถ้าไอแล้วไม่ออก
              ให้ใช้วิธีดันกระบังลมโดยผู้ช่วยเหลือยืนข้างหลังเเล้วทำดังนี้
            </Text>
            <Text>
              1. ใช้นิ้วโป้ง นิ้วชี้ และนิ้วกลางวางทาบลงไปบริเวณลิ้นปี่
              เพื่อหาตำแหน่งกะบังลม
            </Text>
            <Text>2. กำมืออีกข้างวางลงที่ตำแหน่งนิ้วชี้</Text>
            <Text>
              3. ดึงมือข้างที่กางนิ้วชี้ออก สลับมากุมมือที่กำอยู่แล้วกางศอกออก
            </Text>
            <Text>
              4. ดันกำปั้นเข้าหาตัว กระแทกกะบังลมต่อเนื่อง 5 ครั้ง
              ถ้ายังไม่ออกให้ทำไปเรื่อย ๆ จนกว่า อาหาร
              หรือสิ่งแปลกปลอมจะหลุดออกมา
            </Text>
            <Text style={styles.title} category="h6">
              กล้ามเนื้อหัวใจขาดเลือด
            </Text>
            <Text>
              อาการของภาวะกล้ามเนื้อหัวใจขาดเลือดสังเกตได้จากการแน่นหน้าอกด้านซ้าย
              ปวดร้าวมาถึงแขนซ้ายหรือต้นคอ หายใจไม่สะดวก เหมือนจะเป็นลม
              ให้เรียกรถพยาบาลทันที
              แล้วสังเกตอาการอย่างต่อเนื่องว่ามีการเปลี่ยนแปลงหรือไม่
            </Text>
            <Text style={styles.title} category="h6">
              เส้นเลือดในสมองแตกหรือตีบ
            </Text>
            <Text>
              หากพบอาการปวดหัวเฉียบพลัน ปวดจนทนไม่ไหว
              แล้วมีอาการอ่อนแรงที่อวัยวะใดอวัยวะหนึ่งปากเบี้ยว แขนขาอ่อนแรง
              หรืออ่อนแรงเป็นซีกๆ นี่คืออาการของเส้นเลือดในสมองแตกหรือตีบ
              สิ่งที่ต้องทำ คือรีบไปพบแพทย์ให้เร็วที่สุด
            </Text>
          </Layout>
        </ScrollView>
      </>
    </SafeAreaView>
  );
};

export default FirstAidKnowledgeScreen;

const styles = StyleSheet.create({
  title: {
    marginTop: 8,
    marginBottom: 8,
  },
});
